In [1]:
people = {
    "first": ["Onkar",'Yash','Shritej'],
    "Second": ["Galande",'Bangude','Kumbhar'],
    "Email": ["galandeonkar2001@gmail.com",'bangudeyash@gmail.com','kumbharshritya@gmail.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

     first   Second                       Email
0    Onkar  Galande  galandeonkar2001@gmail.com
1     Yash  Bangude       bangudeyash@gmail.com
2  Shritej  Kumbhar    kumbharshritya@gmail.com

In [6]:
#Adding columns

In [7]:
df['first']+ ' '+df['Second']

0      Onkar Galande
1       Yash Bangude
2    Shritej Kumbhar
dtype: object

In [8]:
df['Full Name'] = df['first']+ ' '+df['Second']

In [9]:
df

     first   Second                       Email        Full Name
0    Onkar  Galande  galandeonkar2001@gmail.com    Onkar Galande
1     Yash  Bangude       bangudeyash@gmail.com     Yash Bangude
2  Shritej  Kumbhar    kumbharshritya@gmail.com  Shritej Kumbhar

In [10]:
#Removing columns  (drop)

df.drop(columns=['Full Name'])

     first   Second                       Email
0    Onkar  Galande  galandeonkar2001@gmail.com
1     Yash  Bangude       bangudeyash@gmail.com
2  Shritej  Kumbhar    kumbharshritya@gmail.com

In [11]:
df

     first   Second                       Email        Full Name
0    Onkar  Galande  galandeonkar2001@gmail.com    Onkar Galande
1     Yash  Bangude       bangudeyash@gmail.com     Yash Bangude
2  Shritej  Kumbhar    kumbharshritya@gmail.com  Shritej Kumbhar

In [12]:
#for permanant remove columns
df.drop(columns=['Full Name'], inplace=True)

In [13]:
df

     first   Second                       Email
0    Onkar  Galande  galandeonkar2001@gmail.com
1     Yash  Bangude       bangudeyash@gmail.com
2  Shritej  Kumbhar    kumbharshritya@gmail.com